УТ.ГрафиБотГрафическийКонструкторТелеграмБотов/src/InformationRegisters/гбНомераОбновлений/гбНомераОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гбНомераОбновлений</name>
  <resources>
    <name>НомерОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.гбБоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.ГрафиБотГрафическийКонструкторТелеграмБотов/src/InformationRegisters/гбНомераОбновлений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Записывает номер полученного сообщения
//
// Параметры:
//  Бот		 - Справочник.гбБоты	 - бот
//  Номер	 - Число	 - Номер полученного сообщения
//
Процедура ЗаписатьНомерПолученного(Бот, Номер) Экспорт
	Запись = РегистрыСведений.гбНомераОбновлений.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.НомерОбновления = Номер;
    Запись.Записать();
КонецПроцедуры // ЗаписатьНомерПолученного


// Очищает номер полученного сообщения
//
// Параметры:
//  Бот		 - Справочник.гбБоты	 - бот
//
Процедура ОчиститьНомерПолученного(Бот) Экспорт
	Запись = РегистрыСведений.гбНомераОбновлений.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.Удалить();
КонецПроцедуры // ОчиститьНомерПолученного


// Возвращает номер полученного сообщения
//
// Параметры:
//  Бот		 - Справочник.гбБоты	 - бот
// 
// Возвращаемое значение:
//  Число	 - Номер полученного сообщения
//
Функция ПолучитьНомерПолученного(Бот) Экспорт
	Запись = РегистрыСведений.гбНомераОбновлений.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.Прочитать();
	
	Возврат ?(Запись.Выбран(), Запись.НомерОбновления, Неопределено);
КонецФункции // ПолучитьНомерПолученного

#КонецОбласти

#КонецЕсли
